Revit 2026 API

# ToposolidBooleanPerturbationFailures Properties

---

The BuiltInFailuresToposolidBooleanPerturbationFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | NonPerturbationBooleanFailed | Boolean operation failed without perturbation. |

#### Reference

BuiltInFailuresToposolidBooleanPerturbationFailures Class

Autodesk.Revit.DB Namespace